package util;

public class TitleUtil {
    public static void clearScreen() { // 콘솔창 지우는 메서드
        System.out.println("\033\143");
        System.out.println(title);
    }

    public static String title =
            """
                             _______   ______     ______   .___________.   .______        ___       __       __     \s
                            |   ____| /  __  \\   /  __  \\  |           |   |   _  \\      /   \\     |  |     |  |    \s
                            |  |__   |  |  |  | |  |  |  | `---|  |----`   |  |_)  |    /  ^  \\    |  |     |  |    \s
                            |   __|  |  |  |  | |  |  |  |     |  |        |   _  <    /  /_\\  \\   |  |     |  |    \s
                            |  |     |  `--'  | |  `--'  |     |  |        |  |_)  |  /  _____  \\  |  `----.|  `----.
                            |__|      \\______/   \\______/      |__|        |______/  /__/     \\__\\ |_______||_______|
                                                                                                                    \s
                    """;
}
